In [1]:
import mysql.connector
from mysql.connector import Error

def create_connection(host_name, user_name, user_password, db_name):
    connection = None
    try:
        connection = mysql.connector.connect(
            host = host_name,
            user = user_name,
            passwd = user_password,
            database = db_name
            )
        print("Connection to my DB successful")
    except Error as e:
        print(f'Error \'{e}\' occured')

    return connection

In [24]:
con_d = {'host_name': '127.0.0.1',
         'user_name': 'python_proglib',
         'user_password': 'pythonpasswd4567',
         'db_name': 'python_test'}

connection = create_connection(**con_d)

Connection to my DB successful

In [25]:
def execute_query(connection, query):
    cursor = connection.cursor()
    try:
        cursor.execute(query)
        connection.commit()
        print("Query executed successfully")
    except Error as e:
        print(f'Error \'{e}\' occurred')

In [ ]:
create_users_table = """
CREATE TABLE IF NOT EXISTS users (
    id INT AUTO_INCREMENT,
    name TEXT NOT NULL,
    age INT,
    gender TEXT,
    nationality TEXT,
    PRIMARY KEY (id)
)
"""

execute_query(connection, create_users_table)

In [4]:
create_posts_table = """
CREATE TABLE IF NOT EXISTS posts (
  id INT AUTO_INCREMENT, 
  title TEXT NOT NULL, 
  description TEXT NOT NULL, 
  user_id INTEGER NOT NULL, 
  FOREIGN KEY fk_user_id (user_id) REFERENCES users(id), 
  PRIMARY KEY (id)
) ENGINE = InnoDB
"""

execute_query(connection, create_posts_table)

Query executed successfully

In [5]:
create_comments_table = """
CREATE TABLE IF NOT EXISTS comments(
    id INT AUTO_INCREMENT,
    text TEXT,
    user_id INT NOT NULL,
    post_id INT NOT NULL,
    FOREIGN KEY fk_user_id (user_id) REFERENCES users(id),
    FOREIGN KEY fk_post_id (post_id) REFERENCES posts(id),
    PRIMARY KEY (id)
);
"""

execute_query(connection, create_comments_table)

Query executed successfully

In [7]:
create_likes_table = """
CREATE TABLE IF NOT EXISTS likes(
    id INT AUTO_INCREMENT,
    user_id INT NOT NULL,
    post_id INT NOT NULL,
    FOREIGN KEY fk_user_id (user_id) REFERENCES users(id),
    FOREIGN KEY fk_post_id (post_id) REFERENCES posts(id),
    PRIMARY KEY (id)
);
"""

execute_query(connection, create_likes_table)

Query executed successfully

In [9]:
#Вставка данных 
#Как и другие выполнения возможны и через cursor.execute()
#А можно через оперделенную ранее оболочку execute_query(connection, query)

insert_users = """
INSERT INTO 
    users (name, age, gender, nationality)
VALUES
  ('James', 25, 'male', 'USA'),
  ('Leila', 32, 'female', 'France'),
  ('Brigitte', 35, 'female', 'England'),
  ('Mike', 40, 'male', 'Denmark'),
  ('Elizabeth', 21, 'female', 'Canada');
"""

execute_query(connection, insert_users)

Query executed successfully

In [13]:
create_posts = """
INSERT INTO
  posts (title, description, user_id)
VALUES
  ("Happy", "I am feeling very happy today", 1),
  ("Hot Weather", "The weather is very hot today", 2),
  ("Help", "I need some help with my work", 2),
  ("Great News", "I am getting married", 1),
  ("Interesting Game", "It was a fantastic game of tennis", 5),
  ("Party", "Anyone up for a late-night party today?", 3);
"""

execute_query(connection, create_posts)

Query executed successfully

In [20]:
create_comments = """
INSERT INTO
  comments (text, user_id, post_id)
VALUES
  ('Count me in', 1, 6),
  ('What sort of help?', 5, 3),
  ('Congrats buddy', 2, 4),
  ('I was rooting for Nadal though', 4, 5),
  ('Help with your thesis?', 2, 3),
  ('Many congratulations', 5, 4);
"""

create_likes = """
INSERT INTO
  likes (user_id, post_id)
VALUES
  (1, 6),
  (2, 3),
  (1, 5),
  (5, 4),
  (2, 4),
  (4, 2),
  (3, 6);
"""

execute_query(connection, create_comments)
execute_query(connection, create_likes)

InternalError: Unread result found

#Вставка двух записей в таблицу likes

sql = "INSERT INTO likes ( user_id, post_id ) VALUES ( 4, 5 )"
val = [(4, 5), (3, 4)]

cursor = connection.cursor()
cursor.execute(sql)
connection.commit()

#cursor = connection.cursor(buffered=True,dictionary=True)
В случае появления Unread result found обновить подключение/курсор

In [17]:
#Выбор запсей из таблицы

def execute_read_query(connection, query):
    cursor = connection.cursor()
    result = None
    
    try:
        cursor.execute(query)
        result = cursor.fetchall()
        return result
    except Error as e:
        print(f"The error '{e}' occurred")

In [29]:
#Извлечение записей из таблицы 

select_users = """SELECT * FROM users"""
users = execute_read_query(connection, select_users)

for user in users:
    print(user)

(1, 'James', 25, 'male', 'USA')
(2, 'Leila', 32, 'female', 'France')
(3, 'Brigitte', 35, 'female', 'England')
(4, 'Mike', 40, 'male', 'Denmark')
(5, 'Elizabeth', 21, 'female', 'Canada')

In [34]:
select_posts_comments_users = """
SELECT
    posts.description as post,
    text as comment,
    name
FROM
    posts
    INNER JOIN comments ON posts.id = comments.post_id
    INNER JOIN users ON users.id = comments.user_id 
"""

posts_comments_users = execute_read_query(
    connection, select_posts_comments_users)

for posts_comments_user in posts_comments_users:
    print(posts_comments_user)

('Anyone up for a late-night party today?', 'Count me in', 'James')
('I need some help with my work', 'What sort of help?', 'Elizabeth')
('I am getting married', 'Congrats buddy', 'Leila')
('It was a fantastic game of tennis', 'I was rooting for Nadal though', 'Mike')
('I need some help with my work', 'Help with your thesis?', 'Leila')
('I am getting married', 'Many congratulations', 'Elizabeth')

In [31]:
#Для того чтобы вернуть имена столбцов нужно забрать description

cursor = connection.cursor()
cursor.execute(select_posts_comments_users)
cursor.fetchall()

column_names = [description[0] for description in cursor.description]
print(column_names)

['post', 'comment', 'name']

In [37]:
#следующий скрипт возвращает идентификаторы и имена пользователей,
#а также описание сообщений, опубликованных этими пользователями:

#ON можно заменить на WHERE
select_users_posts = """
SELECT
    users.id,
    users.name,
    posts.description
FROM posts INNER JOIN users ON users.id = posts.user_id
"""

users_posts = execute_read_query(connection, select_users_posts)

for users_post in users_posts:
    print(users_post)

(1, 'James', 'I am feeling very happy today')
(2, 'Leila', 'The weather is very hot today')
(2, 'Leila', 'I need some help with my work')
(1, 'James', 'I am getting married')
(5, 'Elizabeth', 'It was a fantastic game of tennis')
(3, 'Brigitte', 'Anyone up for a late-night party today?')

In [38]:

#Обновление записей в таблице 

#Сперва создадим описание которое обновляем
select_post_description = """SELECT description FROM posts WHERE id=2"""
post_description = execute_read_query(connection, select_post_description)

for description in post_description:
    print(description)

('The weather is very hot today',)

In [39]:
update_post_description = """
UPDATE
    posts
SET
    description = "The weather has become pleasant now"
WHERE 
    id = 2
"""

execute_query(connection, update_post_description)

Query executed successfully

In [40]:
#Проверим
post_description = execute_read_query(connection, select_post_description)
for description in post_description:
    print(description)

('The weather has become pleasant now',)

In [41]:
#Удаление записей

#В качестве примера удалим комментарий с id равным 5

delete_comment = """DELETE FROM comments WHERE id = 5"""
execute_query(connection, delete_comment)

Query executed successfully

In [42]:
select_comments = """SELECT * FROM comments"""
comments = execute_read_query(connection, select_comments)

for comment in comments:
    print(comment)

(1, 'Count me in', 1, 6)
(2, 'What sort of help?', 5, 3)
(3, 'Congrats buddy', 2, 4)
(4, 'I was rooting for Nadal though', 4, 5)
(6, 'Many congratulations', 5, 4)

In [43]:
#Получим имена столбцов 

cursor = connection.cursor()
cursor.execute(select_comments)
cursor.fetchall()

column_names = [description[0] for description in cursor.description]
print(column_names)

['id', 'text', 'user_id', 'post_id']

In [4]:
#[DB_FLAVOR]+[DB_PYTHON_LIBRARY]://[USERNAME]:[PASSWORD]@[DB_HOST]:[PORT]/[DB_NAME]  for URI(or connection string)

In [8]:
import pandas as pd

from sqlalchemy import create_engine

In [10]:
connection = create_engine("mysql://python_proglib:pythonpasswd4567@127.0.0.1:3306/python_test")

In [12]:
df = pd.read_sql_table('users', connection)

In [23]:
df.reset_index(drop=True, inplace=True)
df

   id       name  age  gender nationality
0   1      James   25    male         USA
1   2      Leila   32  female      France
2   3   Brigitte   35  female     England
3   4       Mike   40    male     Denmark
4   5  Elizabeth   21  female      Canada

In [31]:
df.set_index('id', inplace=True)

In [37]:
df

         name  age  gender nationality
id
1       James   25    male         USA
2       Leila   32  female      France
3    Brigitte   35  female     England
4        Mike   40    male     Denmark
5   Elizabeth   21  female      Canada

In [36]:
df.loc[1:2, ['gender', 'age']]

    gender  age
id
1     male   25
2   female   32

In [38]:
pd.read_sql_query('show tables', connection)

  Tables_in_python_test
0              comments
1                 likes
2                 posts
3                 users

In [40]:
df2 = pd.read_sql_query('SELECT name FROM users WHERE users.age > 30', connection)

In [41]:
df2

       name
0     Leila
1  Brigitte
2      Mike